app/controllers/api/v1/skaters_controller.rb

  def index
    @skaters = Skater.all
---
SELECT "skaters".* FROM "skaters"

    def set_skater
      @skater = Skater.find(params[:id])
---
SELECT "skaters".* FROM "skaters" WHERE "skaters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]