app/controllers/api/v1/stances_controller.rb

  def index
    @stances = Stance.all
---
SELECT "stances".* FROM "stances"