app/controllers/api/v1/types_controller.rb

  def index
    @types = Type.all
---
SELECT "types".* FROM "types"