app/controllers/api/v1/variants_controller.rb

  def index
    @variants = Variant.all
---
SELECT "variants".* FROM "variants"